Dataset/Swarm/29-07-24/13/socialNetwork/4/swarm-sn-wrk-mixed-c6525-25g-exp13-havail0-hori1-verti0-infi1-client1-t8-c512-d30-R10000-N4
Using argument nginx
using  args: threads=8 and connections=512 and duration=30 and requests=10000
Running 30s test @ http://localhost:8080
  8 threads and 512 connections
  Thread calibration: mean lat.: 3787.322ms, rate sampling interval: 13639ms
  Thread calibration: mean lat.: 3504.598ms, rate sampling interval: 12632ms
  Thread calibration: mean lat.: 3789.091ms, rate sampling interval: 13639ms
  Thread calibration: mean lat.: 3661.206ms, rate sampling interval: 13385ms
  Thread calibration: mean lat.: 3663.552ms, rate sampling interval: 13746ms
  Thread calibration: mean lat.: 3686.259ms, rate sampling interval: 13590ms
  Thread calibration: mean lat.: 3667.598ms, rate sampling interval: 13484ms
  Thread calibration: mean lat.: 3670.721ms, rate sampling interval: 13410ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    16.47s     5.19s   26.35s    60.19%
    Req/Sec   191.75      9.65   210.00     75.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   16.52s 
 75.000%   20.59s 
 90.000%   23.36s 
 99.000%   26.35s 
 99.900%   27.64s 
 99.990%   28.82s 
 99.999%   29.05s 
100.000%   29.05s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    5013.503     0.000000            1         1.00
    9003.007     0.100000         3029         1.11
   11231.231     0.200000         6030         1.25
   13524.991     0.300000         9048         1.43
   14999.551     0.400000        12066         1.67
   16523.263     0.500000        15082         2.00
   17383.423     0.550000        16585         2.22
   18268.159     0.600000        18101         2.50
   19054.591     0.650000        19613         2.86
   19791.871     0.700000        21111         3.33
   20594.687     0.750000        22599         4.00
   21086.207     0.775000        23365         4.44
   21561.343     0.800000        24105         5.00
   22052.863     0.825000        24875         5.71
   22478.847     0.850000        25610         6.67
   22888.447     0.875000        26384         8.00
   23101.439     0.887500        26744         8.89
   23363.583     0.900000        27132        10.00
   23642.111     0.912500        27493        11.43
   23953.407     0.925000        27878        13.33
   24297.471     0.937500        28256        16.00
   24444.927     0.943750        28455        17.78
   24641.535     0.950000        28627        20.00
   24821.759     0.956250        28822        22.86
   25034.751     0.962500        29000        26.67
   25247.743     0.968750        29188        32.00
   25411.583     0.971875        29284        35.56
   25559.039     0.975000        29384        40.00
   25673.727     0.978125        29482        45.71
   25853.951     0.981250        29564        53.33
   26050.559     0.984375        29662        64.00
   26116.095     0.985938        29705        71.11
   26181.631     0.987500        29755        80.00
   26279.935     0.989062        29803        91.43
   26378.239     0.990625        29846       106.67
   26509.311     0.992188        29892       128.00
   26607.615     0.992969        29919       142.22
   26673.151     0.993750        29945       160.00
   26722.303     0.994531        29966       182.86
   26804.223     0.995313        29989       213.33
   26918.911     0.996094        30012       256.00
   26984.447     0.996484        30023       284.44
   27049.983     0.996875        30035       320.00
   27115.519     0.997266        30046       365.71
   27181.055     0.997656        30057       426.67
   27295.743     0.998047        30071       512.00
   27361.279     0.998242        30076       568.89
   27394.047     0.998437        30080       640.00
   27492.351     0.998633        30088       731.43
   27590.655     0.998828        30093       853.33
   27705.343     0.999023        30099      1024.00
   27754.495     0.999121        30101      1137.78
   28000.255     0.999219        30104      1280.00
   28098.559     0.999316        30107      1462.86
   28196.863     0.999414        30110      1706.67
   28295.167     0.999512        30113      2048.00
   28409.855     0.999561        30114      2275.56
   28508.159     0.999609        30116      2560.00
   28606.463     0.999658        30118      2925.71
   28639.231     0.999707        30119      3413.33
   28671.999     0.999756        30120      4096.00
   28704.767     0.999780        30121      4551.11
   28786.687     0.999805        30123      5120.00
   28786.687     0.999829        30123      5851.43
   28786.687     0.999854        30123      6826.67
   28819.455     0.999878        30124      8192.00
   28819.455     0.999890        30124      9102.22
   28835.839     0.999902        30125     10240.00
   28835.839     0.999915        30125     11702.86
   28835.839     0.999927        30125     13653.33
   28999.679     0.999939        30126     16384.00
   28999.679     0.999945        30126     18204.44
   28999.679     0.999951        30126     20480.00
   28999.679     0.999957        30126     23405.71
   28999.679     0.999963        30126     27306.67
   29048.831     0.999969        30127     32768.00
   29048.831     1.000000        30127          inf
#[Mean    =    16469.411, StdDeviation   =     5194.017]
#[Max     =    29032.448, Total count    =        30127]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  45996 requests in 30.00s, 559.80MB read
  Socket errors: connect 0, read 0, write 0, timeout 44
  Non-2xx or 3xx responses: 1081
Requests/sec:   1533.15
Transfer/sec:     18.66MB